# FrameworkElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneProviderData..::..FrameworkElement Property
DockablePaneProviderData Class See Also
---
The Windows Presentation Framework object containing the pane's user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FrameworkElement FrameworkElement { get; set; }
```

Visual Basic
---
```text
Public Property FrameworkElement As FrameworkElement
	Get
	Set
```

Visual C++
---
```text
public:
property FrameworkElement^ FrameworkElement {
	FrameworkElement^ get ();
	void set (FrameworkElement^ value);
}
```

# Remarks
Using a System.Windows.Controls.Page is recommended. This can be null, in which case it is assumed an IFrameworkElementCreator is provided to create the element on demand.
# See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace